validacao/results/xvwa/no_waf/06_wrk.log
=== wrk | xvwa/no_waf | http://172.18.0.3:80/xvwa/ | 17/07/2026 20:52:01,26 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" http://172.18.0.3:80/xvwa/
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ http://172.18.0.3:80/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   238.68ms  488.49ms   4.82s    93.73%
    Req/Sec   128.06    217.23     1.79k    93.99%
  Latency Distribution
     50%   51.71ms
     75%  319.04ms
     90%  610.70ms
     99%    2.86s 
  19299 requests in 30.08s, 185.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 178
Requests/sec:    641.58
Transfer/sec:      6.17MB
RUN_RC=0

TOOL_RC=0