validacao/results/xvwa/no_waf/06_wrk.log
=== wrk | xvwa/no_waf | http://172.18.0.3:80/xvwa/ | 17/07/2026 20:52:01,26 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" http://172.18.0.3:80/xvwa/
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ http://172.18.0.3:80/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   238.68ms  488.49ms   4.82s    93.73%
    Req/Sec   128.06    217.23     1.79k    93.99%
  Latency Distribution
     50%   51.71ms
     75%  319.04ms
     90%  610.70ms
     99%    2.86s 
  19299 requests in 30.08s, 185.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 178
Requests/sec:    641.58
Transfer/sec:      6.17MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ http://172.18.0.3:80/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   338.50ms  367.70ms   4.97s    84.24%
    Req/Sec    42.52     50.01   575.00     89.90%
  Latency Distribution
     50%  201.90ms
     75%  529.12ms
     90%  859.85ms
     99%    1.32s 
  11772 requests in 30.10s, 63.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:    391.14
Transfer/sec:      2.10MB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ http://172.18.0.3:80/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   260.39ms  261.62ms   4.62s    82.47%
    Req/Sec    77.50     67.04   740.00     78.56%
  Latency Distribution
     50%  157.16ms
     75%  452.86ms
     90%  614.85ms
     99%  937.83ms
  13210 requests in 30.10s, 132.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 127
Requests/sec:    438.91
Transfer/sec:      4.40MB
RUN_RC_3=0

TOOL_RC=0